Revit 2027 API
View.GetElementOverrides Method
 Gets graphic overrides for an element in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings GetElementOverrides(
	ElementId elementId
)
Public Function GetElementOverrides (
	elementId As ElementId
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ GetElementOverrides(
	ElementId^ elementId
)
member GetElementOverrides :
        elementId : ElementId -> OverrideGraphicSettings
Parameters
elementId ElementId
 The element.
Return Value
OverrideGraphicSettings
 An object representing all graphic overrides of the element elementId in view.
Exceptions
Exception | Condition
ArgumentException |  elementId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace